#include <iostream>
using namespace std;

void count_of_prod()
{
    /*
    1. Считать число
    2. Классифицировать его
    3. Инкрементировать соответствующий счетчик
    4. Вывести сумму всех счетчиков
    */
    cout << "Hello, world!" << endl;
}

int main()
{
    count_of_prod();
}